In [1]:
import pandas as pd

In [3]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s = pd.Series([1,2,3,4], index=["A",'B', 'C','D'])
s

A    1
B    2
C    3
D    4
dtype: int64

In [2]:
data_1 = [[1,111,'ahmed'],
          [2,222,'Dai'],
          [3,333,'Youssef'],
          [4,444,'abdalla']
         ]
type(data_1)

list

In [5]:
import pandas as pd
data_1 = [[1,111,'ahmed'],
          [2,222,'Dai'],
          [3,333,'Youssef'],
          [4,444,'abdalla']
         ]
# type(data_1)
# print(data_1)
x = ["index","ID","Name"]
df = pd.DataFrame(data_1,columns=["index","ID","Name"])
df

   index   ID     Name
0      1  111    ahmed
1      2  222      Dai
2      3  333  Youssef
3      4  444  abdalla

In [6]:
data_2 = {'s1':[10,15,17,9],
          's2':[8,7,12,15],
          's3':['math','cs', 'stat','OR']}
df = pd.DataFrame(data_2)
df

   s1  s2    s3
0  10   8  math
1  15   7    cs
2  17  12  stat
3   9  15    OR

In [7]:
display(df)

   s1  s2    s3
0  10   8  math
1  15   7    cs
2  17  12  stat
3   9  15    OR

In [8]:
def abs():
    return f"hello"

In [9]:
class test:
    
    def __init__(self, name: str):
        self.name = name
    
    @property
    def info(self):
        """  
        this method get only info abut the name of std
        """
        
        return self. name

In [10]:
t1= test("George")
t1.info

'George'

In [13]:
data_1 = [[1,111,'ahmed'],
          [2,111,'Dai'],
          [3,333,'Youssef'],
          [4,444,'abdalla']
         ]
type(data_1)
# print(data_1)
df = pd.DataFrame(data_1,columns=["index","ID","Name"])
display(df)
df.dtypes

   index   ID     Name
0      1  111    ahmed
1      2  111      Dai
2      3  333  Youssef
3      4  444  abdalla

index     int64
ID        int64
Name     object
dtype: object

In [8]:
df['Name'].dtype

dtype('O')

In [ ]:

df["Name"] = df ["Name"].astype("category")
df.dtypes

index       int64
ID          int64
Name     category
dtype: object

In [10]:
# EDA  Exploratory DATA ANALYSIS
df.head(1)

   index   ID   Name
0      1  111  ahmed

In [14]:
df.tail(1)

   index   ID     Name
3      4  444  abdalla

In [15]:
df.describe()

          index      ID
count  4.000000    4.00
mean   2.500000  249.75
std    1.290994  166.50
min    1.000000  111.00
25%    1.750000  111.00
50%    2.500000  222.00
75%    3.250000  360.75
max    4.000000  444.00

In [16]:
df.describe(include='category')

       Name
count     4
unique    4
top     Dai
freq      1

In [12]:
df['Name'].unique()

array(['ahmed', 'Dai', 'Youssef', 'abdalla'], dtype=object)

In [ ]:
ddd= df['ID'].max()

np.int64(444)

In [ ]:
index = df['ID'].idxmax()

3

In [20]:
df['ID'].min()

np.int64(111)

In [21]:
df['ID'].idxmin()

0

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   4 non-null      int64
 1   ID      4 non-null      int64
 2   Name    4 non-null      category
dtypes: category(1), int64(2)
memory usage: 404.0 bytes

In [23]:
d= df["ID"].value_counts()
d

ID
111    2
333    1
444    1
Name: count, dtype: int64

In [24]:
d= df["ID"]
d

0    111
1    111
2    333
3    444
Name: ID, dtype: int64

In [16]:
c = df['ID'].values
type(c)
c

array([111, 111, 333, 444])

In [26]:
df.values

array([[1, 111, 'ahmed'],
       [2, 111, 'Dai'],
       [3, 333, 'Youssef'],
       [4, 444, 'abdalla']], dtype=object)

In [17]:
df.replace(111, "101010")

   index      ID     Name
0      1  101010    ahmed
1      2  101010      Dai
2      3     333  Youssef
3      4     444  abdalla

In [28]:
df.replace({333:"youssef", 444:"Asmaa"})

   index       ID     Name
0      1      111    ahmed
1      2      111      Dai
2      3  youssef  Youssef
3      4    Asmaa  abdalla

In [29]:
def duplicate(x):
    return x*2
df['index'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: index, dtype: int64

In [30]:
data_1 = [[1,111,'ahmed'],
          [2,111,'Dai'],
          [3,333,'Youssef'],
          [4,444,'abdalla']
         ]
type(data_1)
# print(data_1)
df = pd.DataFrame(data_1,columns=["index","ID","Name"])
display(df)
# df.dtypes

   index   ID     Name
0      1  111    ahmed
1      2  111      Dai
2      3  333  Youssef
3      4  444  abdalla

In [31]:
df.ID.iloc[0:2]

0    111
1    111
Name: ID, dtype: int64

In [20]:

# X= df.iloc[:,0:2]
# print(X)
x= df.iloc[:,:-1]
y= df.iloc[:,-1]

In [21]:
x

   index   ID
0      1  111
1      2  111
2      3  333
3      4  444

In [23]:
y

0      ahmed
1        Dai
2    Youssef
3    abdalla
Name: Name, dtype: object

In [24]:
data_1 = [[1,111,'ahmed'],
          [2,111,'Dai'],
          [3,333,'Youssef'],
          [4,444,'abdalla']
         ]
type(data_1)
# print(data_1)
df = pd.DataFrame(data_1,columns=["index","ID","Name"])
display(df)
df.dtypes

   index   ID     Name
0      1  111    ahmed
1      2  111      Dai
2      3  333  Youssef
3      4  444  abdalla

index     int64
ID        int64
Name     object
dtype: object

In [25]:
new_co  = df['index'] + df.ID
df.insert(3,"new_feature", new_co)
df

   index   ID     Name  new_feature
0      1  111    ahmed          112
1      2  111      Dai          113
2      3  333  Youssef          336
3      4  444  abdalla          448

In [ ]:
df.drop('new_feature', axis=1,inplace=True)
df

   index   ID     Name
0      1  111    ahmed
1      2  111      Dai
2      3  333  Youssef
3      4  444  abdalla

In [2]:
#to read table from link or you can put the path of your own tabl
data=pd.read_table('http://bit.ly/movieusers')
data.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [3]:
data=pd.read_table('http://bit.ly/movieusers', sep='|')
data.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

In [4]:
data=pd.read_table('http://bit.ly/movieusers', sep='|', header= None)
data.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [5]:
header_colums = ['index','age','gender','dept','postal_code']
data=pd.read_table('http://bit.ly/movieusers', sep='|', header= None, names = header_colums)
data.head()

   index  age gender        dept postal_code
0      1   24      M  technician       85711
1      2   53      F       other       94043
2      3   23      M      writer       32067
3      4   24      M  technician       43537
4      5   33      F       other       15213

In [6]:
user_info=pd.read_csv('http://bit.ly/uforeports')
user_info.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [7]:
user_info['Colors Reported'].head()

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Colors Reported, dtype: object

In [8]:
user_info.shape

(18241, 5)

In [43]:
user_info.City + ' ' + user_info.State

0                      Ithaca NY
1                 Willingboro NJ
2                     Holyoke CO
3                     Abilene KS
4        New York Worlds Fair NY
                  ...
18236              Grant Park IL
18237             Spirit Lake IA
18238             Eagle River WI
18239             Eagle River WI
18240                    Ybor FL
Length: 18241, dtype: object

In [44]:
user_info['location'] =  user_info.City + ' ' + user_info.State
user_info.head()

,City,Colors Reported,Shape Reported,State,Time,location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair NY

In [45]:
user_info.to_csv('new_features.csv')

In [28]:
new_file = pd.read_csv('new_features.csv')
new_file.head()

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time,location
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke CO
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene KS
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair NY

In [29]:
new_file.describe()

         Unnamed: 0
count  18241.000000
mean    9120.000000
std     5265.867466
min        0.000000
25%     4560.000000
50%     9120.000000
75%    13680.000000
max    18240.000000

In [30]:
new_file.dtypes

Unnamed: 0          int64
City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
location           object
dtype: object

In [31]:
new_file.describe(include='object')

,City,Colors Reported,Shape Reported,State,Time,location
count,18215,2882,15597,18241,18241,18215
unique,6475,27,27,52,16145,8028
top,Seattle,RED,LIGHT,CA,11/16/1999 19:00,Seattle WA
freq,187,780,2803,2529,27,187

In [32]:
new_file[0:10]

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time,location
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke CO
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene KS
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair NY
5,5,Valley City,NaN,DISK,ND,9/15/1934 15:30,Valley City ND
6,6,Crater Lake,NaN,CIRCLE,CA,6/15/1935 0:00,Crater Lake CA
7,7,Alma,NaN,DISK,MI,7/15/1936 0:00,Alma MI
8,8,Eklutna,NaN,CIGAR,AK,10/15/1936 17:00,Eklutna AK
9,9,Hubbard,NaN,CYLINDER,OR,6/15/1937 0:00,Hubbard OR

In [33]:
new_file.columns

Index(['Unnamed: 0', 'City', 'Colors Reported', 'Shape Reported', 'State',
       'Time', 'location'],
      dtype='object')

In [34]:
new_file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       18241 non-null  int64
 1   City             18215 non-null  object
 2   Colors Reported  2882 non-null   object
 3   Shape Reported   15597 non-null  object
 4   State            18241 non-null  object
 5   Time             18241 non-null  object
 6   location         18215 non-null  object
dtypes: int64(1), object(6)
memory usage: 997.7+ KB

In [35]:
new_file.head(2)

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time,location
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ

In [36]:
new_file.rename(columns={'Colors Reported':'Colors_Reported','Shape Reported':'Shape_Reported'},  inplace=True)

In [37]:
new_file.head(2)

,Unnamed: 0,City,Colors_Reported,Shape_Reported,State,Time,location
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ

In [38]:
new_file.columns

Index(['Unnamed: 0', 'City', 'Colors_Reported', 'Shape_Reported', 'State',
       'Time', 'location'],
      dtype='object')

In [39]:
new_file.columns.str.replace(' ', '_')

Index(['Unnamed:_0', 'City', 'Colors_Reported', 'Shape_Reported', 'State',
       'Time', 'location'],
      dtype='object')

In [40]:
new_file.head(2)

,Unnamed: 0,City,Colors_Reported,Shape_Reported,State,Time,location
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ

In [59]:
new_file.drop(['Colors_Reported','City'],axis=1, inplace=True)# axis = 1 for columns , axis = 0 for rows

In [60]:
new_file.head(2)

   Unnamed:_0 Shape_Reported State             Time        location
0           0       TRIANGLE    NY   6/1/1930 22:00       Ithaca NY
1           1          OTHER    NJ  6/30/1930 20:00  Willingboro NJ

In [61]:
new_file.drop([0,1,2], axis=0, inplace=True)

In [62]:
new_file.head()

   Unnamed:_0 Shape_Reported State             Time                 location
3           3           DISK    KS   6/1/1931 13:00               Abilene KS
4           4          LIGHT    NY  4/18/1933 19:00  New York Worlds Fair NY
5           5           DISK    ND  9/15/1934 15:30           Valley City ND
6           6         CIRCLE    CA   6/15/1935 0:00           Crater Lake CA
7           7           DISK    MI   7/15/1936 0:00                  Alma MI

In [63]:
movies=pd.read_csv('http://bit.ly/imdbratings')

In [72]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [41]:
df = pd.read_csv('D:/Depi_DS_BS/DEPI_BNS_DS_R3/Sourses/DS/Linear_Algebra/new_features.csv')

In [42]:
df.head()

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time,location
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke CO
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene KS
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair NY

In [ ]:
movies.title.sort_values(ascending=False)# sort by alphabet

542     (500) Days of Summer
5               12 Angry Men
201         12 Years a Slave
698                127 Hours
110    2001: A Space Odyssey
               ...
955         Zero Dark Thirty
677                   Zodiac
615               Zombieland
526                     Zulu
864                    [Rec]
Name: title, Length: 979, dtype: object

In [66]:
movies.sort_values('title')

,star_rating,title,content_rating,genre,duration,actors_list
542,7.8,(500) Days of Summer,PG-13,Comedy,95,"[u'Zooey Deschanel', u'Joseph Gordon-Levitt', ..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
201,8.1,12 Years a Slave,R,Biography,134,"[u'Chiwetel Ejiofor', u'Michael Kenneth Willia..."
698,7.6,127 Hours,R,Adventure,94,"[u'James Franco', u'Amber Tamblyn', u'Kate Mara']"
110,8.3,2001: A Space Odyssey,G,Mystery,160,"[u'Keir Dullea', u'Gary Lockwood', u'William S..."
...,...,...,...,...,...,...
955,7.4,Zero Dark Thirty,R,Drama,157,"[u'Jessica Chastain', u'Joel Edgerton', u'Chri..."
677,7.7,Zodiac,R,Crime,157,"[u'Jake Gyllenhaal', u'Robert Downey Jr.', u'M..."
615,7.7,Zombieland,R,Comedy,88,"[u'Jesse Eisenberg', u'Emma Stone', u'Woody Ha..."
526,7.8,Zulu,UNRATED,Drama,138,"[u'Stanley Baker', u'Jack Hawkins', u'Ulla Jac..."
864,7.5,[Rec],R,Horror,78,"[u'Manuela Velasco', u'Ferran Terraza', u'Jorg..."

In [69]:
movies.sort_values(['content_rating','duration'])

,star_rating,title,content_rating,genre,duration,actors_list
713,7.6,The Jungle Book,APPROVED,Animation,78,"[u'Phil Harris', u'Sebastian Cabot', u'Louis P..."
513,7.8,Invasion of the Body Snatchers,APPROVED,Horror,80,"[u'Kevin McCarthy', u'Dana Wynter', u'Larry Ga..."
272,8.1,The Killing,APPROVED,Crime,85,"[u'Sterling Hayden', u'Coleen Gray', u'Vince E..."
703,7.6,Dracula,APPROVED,Horror,85,"[u'Bela Lugosi', u'Helen Chandler', u'David Ma..."
612,7.7,A Hard Day's Night,APPROVED,Comedy,87,"[u'John Lennon', u'Paul McCartney', u'George H..."
...,...,...,...,...,...,...
387,8.0,Midnight Cowboy,X,Drama,113,"[u'Dustin Hoffman', u'Jon Voight', u'Sylvia Mi..."
86,8.4,A Clockwork Orange,X,Crime,136,"[u'Malcolm McDowell', u'Patrick Magee', u'Mich..."
187,8.2,Butch Cassidy and the Sundance Kid,NaN,Biography,110,"[u'Paul Newman', u'Robert Redford', u'Katharin..."
936,7.4,True Grit,NaN,Adventure,128,"[u'John Wayne', u'Kim Darby', u'Glen Campbell']"
649,7.7,Where Eagles Dare,NaN,Action,158,"[u'Richard Burton', u'Clint Eastwood', u'Mary ..."

In [70]:
bol= []
for length in movies.duration:
    if length >=200:
        bol.append(True)
    else:
        bol.append(False)

In [71]:
bol[0:3]

[False, False, True]

In [73]:
movies.loc[movies['duration'] > 200,'genre' ]

7      Adventure
17         Drama
78         Crime
85     Adventure
142    Adventure
157        Drama
204    Adventure
445    Adventure
476        Drama
630    Biography
767       Action
Name: genre, dtype: object

In [74]:
movies.loc[(movies['duration'] > 200) & (movies['genre']=='Drama')]

,star_rating,title,content_rating,genre,duration,actors_list
17,8.7,Seven Samurai,UNRATED,Drama,207,"[u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K..."
157,8.2,Gone with the Wind,G,Drama,238,"[u'Clark Gable', u'Vivien Leigh', u'Thomas Mit..."
476,7.8,Hamlet,PG-13,Drama,242,"[u'Kenneth Branagh', u'Julie Christie', u'Dere..."